pjalocha/nrf52-ogn-tracker/src/main.cpp
#include "main.h"
#include "gps.h"
#include "proc.h"
#include "ogn-radio.h"

#include "external_flash_fs.h"
#ifdef WITH_LOG
#include "log.h"
#endif
#include "epd.h"
#include "oled.h"

#include <Wire.h>

#include "Button2.h"

#ifdef WITH_BLE_SPP
#include <bluefruit.h>
#include "nrf_sdm.h"
#include "nrf_soc.h"
#endif

// =======================================================================================================

SemaphoreHandle_t CONS_Mutex;
SemaphoreHandle_t I2C_Mutex;
#ifdef WITH_BLE_SPP
SemaphoreHandle_t BLE_Mutex;
#endif

// =======================================================================================================

uint8_t PowerMode = 2;
Word32x2 Random = { .Word = 0x123456789ABCDEF0ULL };
HardItems HardwareStatus = { .Flags = 0 };

// =======================================================================================================

void LED_PCB_On(bool ON)
{ digitalWrite(LED_PinRed, ON ? LED_StateOn : LED_StateOff); }

void LED_PCB_Off(void)
{ LED_PCB_On(false); }

void LED_PCB_Flash(uint8_t Time)
{ LED_PCB_On(true);
  if(Time>10) Time=10;
  delay(Time);
  LED_PCB_On(false); }

void LED_OGN_RX(uint8_t ms) { }
void LED_OGN_TX(uint8_t ms) { }

// =======================================================================================================

uint64_t getUniqueMAC(void) { uint64_t MAC = ((uint64_t)NRF_FICR->DEVICEID[1] << 32) | NRF_FICR->DEVICEID[0]; return MAC; }

uint64_t getUniqueID(void)      { return getUniqueMAC(); }         // get unique serial ID of the CPU/chip
uint32_t getUniqueAddress(void) { return getUniqueMAC()&0x00FFFFFF; } // get unique OGN address

// =======================================================================================================

static uint8_t I2C_Scan(TwoWire &Wire, const char *Title)
{ Serial.printf(Title);
  uint32_t Time=millis();
  uint8_t I2Cdev=0;
  for(uint8_t Addr=0x08; Addr<=0x77; Addr++)
  { delay(1);
    Wire.beginTransmission(Addr);
    if(Wire.endTransmission()==0)
    { Serial.printf(" 0x%02X", Addr); I2Cdev++; }
  }
  Time=millis()-Time;
  Serial.printf(" %d devices (%dms)\n", I2Cdev, Time);
  return I2Cdev; }

// =======================================================================================================

int16_t readMCUtemperature(void)
{
#ifdef WITH_BLE_SPP
  uint8_t SoftDeviceEnabled = 0;
  if((sd_softdevice_is_enabled(&SoftDeviceEnabled)==NRF_SUCCESS) && SoftDeviceEnabled)
  { int32_t Temp = 0;
    if(sd_temp_get(&Temp)==NRF_SUCCESS) return (Temp*10+2)/4; } // [0.1degC]
#endif
  NRF_TEMP->TASKS_START = 1;
  while(!NRF_TEMP->EVENTS_DATARDY);
  int32_t Temp = NRF_TEMP->TEMP;
  NRF_TEMP->EVENTS_DATARDY = 0;
  NRF_TEMP->TASKS_STOP = 1;
  return Temp=(Temp*10+2)/4; }             // [0.1degC]

static int ADC_Init(void)
{ // analogReadResolution(12);             // default is 10 bits, no need to change
  analogReference(AR_INTERNAL_3_0); }      // so 1024 ADC counts is 3.0V

uint16_t BatterySense(int Samples)
{ uint32_t Volt=0;
  for( int Idx=0; Idx<Samples; Idx++)
  { Volt += analogRead(Battery_Pin); }
#ifdef WITH_WIO_TRACKER
  Volt = (Volt*579+Samples*50)/(Samples*100); // [mV] calibrated 5.79mV/count for Wio Tracker
#else
  Volt = (Volt*11+Samples)/(Samples*2);
#endif
  return Volt; }                           // [mV]

// =======================================================================================================

FlashParameters Parameters;  // parameters stored in Flash: address, aircraft type, etc.

// =======================================================================================================

#ifdef WITH_BLE_SPP

static BLEService BLE_SPP_Service(0xFFE0);
static BLECharacteristic BLE_SPP_Char(0xFFE1);

static void BLE_StartAdvertising()
{ Bluefruit.Advertising.stop();
  Bluefruit.Advertising.addFlags(BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE);
  Bluefruit.Advertising.addTxPower();
  Bluefruit.Advertising.addService(BLE_SPP_Service);
  Bluefruit.ScanResponse.addName();
  Bluefruit.Advertising.restartOnDisconnect(true);
  Bluefruit.Advertising.setInterval(32, 244);
  Bluefruit.Advertising.setFastTimeout(30);
  Bluefruit.Advertising.start(0); }

static void BLE_Init(void)
{ Bluefruit.autoConnLed(false);
  Bluefruit.configPrphBandwidth(BANDWIDTH_MAX);
  if(!Bluefruit.begin(1, 0)) return;             // 1 client allowed, no connections to external servers
  Bluefruit.setName(Parameters.BTname);
  Bluefruit.setTxPower(0);                       // [dBm] BLE transmitter power

  BLE_SPP_Service.begin();

  BLE_SPP_Char.setProperties(CHR_PROPS_READ | CHR_PROPS_WRITE | CHR_PROPS_WRITE_WO_RESP | CHR_PROPS_NOTIFY);
  BLE_SPP_Char.setPermission(SECMODE_OPEN, SECMODE_OPEN);
  BLE_SPP_Char.setMaxLen(Bluefruit.getMaxMtu(BLE_GAP_ROLE_PERIPH));
  BLE_SPP_Char.setUserDescriptor("BLE SPP");
  BLE_SPP_Char.begin();

  BLE_StartAdvertising();
}

FIFO<char, 4096> BLE_SPP_TxFIFO;

bool BLE_isConnected(void) { return Bluefruit.connected(); }
bool BLE_SPP_isConnected(void) { return BLE_SPP_Char.notifyEnabled(); }

static void BLE_Loop(void)
{ if( !BLE_isConnected() || !BLE_SPP_isConnected()) { BLE_SPP_TxFIFO.flush(); return; }
  char *Block;
  int Size=BLE_SPP_TxFIFO.getReadBlock(Block); if(Size<=0) return;
  uint16_t ConnHandle = Bluefruit.connHandle();
  BLEConnection *Conn = Bluefruit.Connection(ConnHandle);
  int Payload = Conn ? Conn->getMtu()-3 : 20;
  if(Payload<1) Payload=20;
  if(Size>Payload) Size=Payload;
  if(BLE_SPP_Char.notify(ConnHandle, (uint8_t *)Block, Size))
    BLE_SPP_TxFIFO.flushReadBlock(Size); }

void BLE_UART_Write(char Byte) { BLE_SPP_TxFIFO.Write(Byte); }
int  BLE_UART_Free(void) { return BLE_SPP_TxFIFO.Free(); }

#endif

// =======================================================================================================

#ifdef WITH_OLED

static const uint8_t OLED_Page_ID          = 0;
static const uint8_t OLED_Page_GPS         = 1;
static const uint8_t OLED_Page_SatSNR      = 2;
static const uint8_t OLED_Page_Baro        = 3;
static const uint8_t OLED_Page_RF          = 4;
static const uint8_t OLED_Page_RFcounts    = 5;
static const uint8_t OLED_Page_Power       = 6;
static const uint8_t OLED_Page_RelayOGN    = 7;
static const uint8_t OLED_Page_RelayADSL   = 8;
const  uint8_t  OLED_Pages      = 9;       // number of OLED pages
static uint8_t  OLED_Page       = 0;       // page currently on display
static uint8_t  OLED_PageChange = 0;       // signal the page has been changed
static uint8_t  OLED_PageOFF    = 0;       // Backlight to be OFF
uint8_t         OLED_Rotate     = 0;       // rotate OLED by 180 degrees
#ifdef WITH_OLED_DIM
static uint32_t OLED_PageActive = 0;       // [ms] last time the page was active (button pressed)
const  uint32_t OLED_PageTimeout = (uint32_t)60000*WITH_OLED_DIM;  // [ms] timeout to turn off the TFT backlight
#endif

static bool OLED_PageAvailable(uint8_t Page)
{ switch(Page)
  { case OLED_Page_ID:
    case OLED_Page_GPS:
    case OLED_Page_SatSNR:
    case OLED_Page_RF:
    case OLED_Page_RFcounts:
    case OLED_Page_Power:
    case OLED_Page_RelayOGN:
    case OLED_Page_RelayADSL:
      return true;
    case OLED_Page_Baro:
#if defined(WITH_BMP180) || defined(WITH_BMP280) || defined(WITH_MS5607) || defined(WITH_BME280) || defined(WITH_MS5611)
      return true;
#else
      return false;
#endif
    default:
      return false; } }

static void OLED_NextPage(void)
{ for(uint8_t Idx=0; Idx<OLED_Pages; Idx++)
  { OLED_Page++;
    if(OLED_Page>=OLED_Pages) OLED_Page=0;
    if(OLED_PageAvailable(OLED_Page)) break; }
  OLED_PageChange=1; }

static int OLED_DrawPage(const GPS_Position *GPS)
{ if(OLED_PageOFF) return 1;
  if(!OLED_PageAvailable(OLED_Page)) return 0;
  OLED.clearBuffer();
  switch(OLED_Page)
  { case OLED_Page_ID:        OLED_DrawID       (OLED.getU8g2(), GPS); break;
    case OLED_Page_GPS:       OLED_DrawGPS      (OLED.getU8g2(), GPS); break;
    case OLED_Page_SatSNR:    OLED_DrawSatSNR   (OLED.getU8g2(), GPS); break;
    case OLED_Page_Baro:      OLED_DrawBaro     (OLED.getU8g2(), GPS); break;
    case OLED_Page_RF:        OLED_DrawRF       (OLED.getU8g2(), GPS); break;
    case OLED_Page_RFcounts:  OLED_DrawRFcounts (OLED.getU8g2(), GPS); break;
    case OLED_Page_Power:     OLED_DrawPower    (OLED.getU8g2(), GPS); break;
    case OLED_Page_RelayOGN:  OLED_DrawRelayOGN (OLED.getU8g2(), GPS); break;
    case OLED_Page_RelayADSL: OLED_DrawRelayADSL(OLED.getU8g2(), GPS); break;
    default: return 0; }
  OLED_DrawStatusBar(OLED.getU8g2(), GPS);
  if(xSemaphoreTake(I2C_Mutex, 50))
  { OLED.sendBuffer();
    xSemaphoreGive(I2C_Mutex); }
  return 1; }

#endif

// =======================================================================================================

