pjalocha/nrf52-ogn-tracker/src/main.cpp
#ifdef WITH_CONFIG
static void ReadParameters(void)  // read parameters requested by the user in the NMEA sent.
{ if((!NMEA.hasCheck()) || NMEA.isChecked() )
  { PrintParameters();
    if(NMEA.Parms==0) { PrintPOGNS(); return; }                              // if no parameter given
    Parameters.ReadPOGNS(NMEA);
    PrintParameters();
    Parameters.WriteToNVS();                                                  // erase and write the parameters into >
  }
}
#endif

#ifdef WITH_LOOKOUT
static void ListTraffic(void)
{ char Line[160];
  for( uint8_t Idx=0; Idx<Look.MaxTargets; Idx++)
  { const LookOut_Target *Tgt = Look.Target+Idx; if(!Tgt->Alloc) continue;
    int Len=Tgt->Print(Line);
    Line[Len++]=' ';
    Len+=Tgt->Pos.Print(Line+Len);
    Serial.printf("%2d: %s\n", Idx, Line); }
}
#endif

#ifdef WITH_CONFIG
static void ReadPFLAC(void)  // read parameters requested by the user in the NMEA
{ if((!NMEA.hasCheck()) || NMEA.isChecked() )
  { PrintParameters();
    // if(NMEA.Parms==0) { PrintPOGNS(); return; }                              // if no parameter given
    Parameters.ReadPFLAC(NMEA);
    PrintParameters();
    Parameters.WriteToNVS();                                                  // erase and write the parameters into >
  }
}
#endif

#ifdef WITH_LOG
static void ListLogFile(void)
{
  if(NMEA.Parms!=1) return;
  uint32_t FileTime = FlashLog_ReadShortFileTime((const char *)NMEA.ParmPtr(0), NMEA.ParmLen(0));
  if(FileTime==0) return;
  FlashLog_ListFile(FileTime);
}
#endif

static void ReadPFLA(void)  // read and interprete $PFLAx NMEA
{ if(NMEA.isPFLAC()) return ReadPFLAC();

}

static void ProcessNMEA(void)     // process a valid NMEA that we got to the console
{
#ifdef WITH_CONFIG
  if(NMEA.isPOGNS()) ReadParameters();
  if(NMEA.isPFLA()) ReadPFLA();
#endif
#ifdef WITH_LOG
  if(NMEA.isPOGNL()) ListLogFile();
#endif
}

static void ProcessCtrlC(void)                                  // print system state to the console
{ if(!xSemaphoreTake(CONS_Mutex, 50)) return;
  Parameters.Print(Line);
  Format_String(CONS_UART_Write, Line);
  Format_String(CONS_UART_Write, "GPS: ");
  Format_UnsDec(CONS_UART_Write, GPS_getBaudRate(), 1);
  Format_String(CONS_UART_Write, "bps");
  CONS_UART_Write(',');
  Format_UnsDec(CONS_UART_Write, GPS_PosPeriod, 4, 3);
  CONS_UART_Write('s');
  if(GPS_Status.PPS)         Format_String(CONS_UART_Write, ",PPS");
  if(GPS_Status.NMEA)        Format_String(CONS_UART_Write, ",NMEA");
  if(GPS_Status.UBX)         Format_String(CONS_UART_Write, ",UBX");
  if(GPS_Status.MAV)         Format_String(CONS_UART_Write, ",MAV");
  if(GPS_Status.BaudConfig)  Format_String(CONS_UART_Write, ",BaudOK");
  if(GPS_Status.ModeConfig)  Format_String(CONS_UART_Write, ",ModeOK");
  CONS_UART_Write('\r'); CONS_UART_Write('\n');
  Parameters.Write(CONS_UART_Write);                         // write the parameters to the console

  Serial.printf("Batt:%6.4fV %+4.1fmV/min\n", 0.0001f*((10*BatteryVoltage+128)>>8), 0.1f*((600*BatteryVoltageRate+128)>>8));
  // Format_String(CONS_UART_Write, "Batt:");
  // Format_UnsDec(CONS_UART_Write, (10*BatteryVoltage+128)>>8, 5, 4);
  // Format_String(CONS_UART_Write, "V ");
  // Format_SignDec(CONS_UART_Write, (600*BatteryVoltageRate+128)>>8, 3, 1);
  // Format_String(CONS_UART_Write, "mV/min\n");

  // lfs_t *lfs = InternalFS._getFS();
  // Serial.printf("InternalFS TotalBlocks:%lu x %lu B\n", lfs->cfg->block_count, lfs->cfg->block_size);

  // uint32_t TotalBytes = lfs->cfg->block_count * lfs->cfg->block_size;
  // uint32_t UsedBytes = lfs_fs_size(lfs) * lfs->cfg->block_size;
  // Serial.printf("InternalFS Total:%3.1f Used:%3.1f [MB]\n", (1.0f/0x1000000)*TotalBytes, (1.0f/0x1000000)*UsedBytes);
  LogFS_printStatus(Serial);

  xSemaphoreGive(CONS_Mutex); }

static void ProcessCtrlX(void)
{ static uint32_t LastTime=0;
  uint32_t Time=millis();
  uint32_t Diff=Time-LastTime;
  if(Diff<1000)
  { // SysLog_Line("Restart from console", 1, 50);
    // ShutDownReq=1;
    vTaskDelay(2000);
    // ESP.restart();
    NVIC_SystemReset(); }
  LastTime=Time; } 

static void ProcessCtrlL(void)
{
#ifdef WITH_LOG
  int Files = FlashLog_ListFiles();
  if(Files<=0) Serial.println("FlashLog: no log files");
#else
  Serial.println("FlashLog: not enabled");
#endif
}

static void ProcessCtrlO(void)
{ static uint32_t LastTime=0;
  uint32_t Time=millis();
  uint32_t Diff=Time-LastTime;
  if(Diff<1000)
  {
#ifdef WITH_LOG
    if(FlashLog_isOpen())
    { Serial.println("ExternalFlash: log file is open, format skipped");
      LastTime=Time;
      return; }
#endif
    HardwareStatus.SPIFFS = LogFS_format(Serial);
    LogFS_listRoot(Serial); }
  else
  { Serial.println("ExternalFlash: press Ctrl-O again within 1s to format FAT"); }
  LastTime=Time; }

static int ProcessInput(void)
{
  const uint8_t CtrlB = 'B'-'@';
  const uint8_t CtrlC = 'C'-'@';
  const uint8_t CtrlF = 'F'-'@';
  const uint8_t CtrlL = 'L'-'@';
  const uint8_t CtrlO = 'O'-'@';
  const uint8_t CtrlP = 'P'-'@';
  const uint8_t CtrlT = 'T'-'@';
  const uint8_t CtrlX = 'X'-'@';

  int Count=0;
  for( ; ; )
  { uint8_t Byte; int Err=CONS_UART_Read(Byte); if(Err<=0) break; // get byte from console, if none: exit the loop
    Count++;
    if(Byte==CtrlC) ProcessCtrlC();                                // if Ctrl-C: print parameters
    if(Byte==CtrlF) LogFS_listRoot(Serial);                         // if Ctrl-F: list external flash root
    if(Byte==CtrlL) ProcessCtrlL();                                  // if Ctrl-L: list log files
    if(Byte==CtrlO) ProcessCtrlO();                                  // double Ctrl-O formats external flash FAT
#ifdef WITH_LOOKOUT
    if(Byte==CtrlT) ListTraffic();                                 // if Ctrl-T: print traffic
#endif
    if(Byte==CtrlX) ProcessCtrlX();                                // double Ctrl-X restarts the system
    NMEA.ProcessByte(Byte);                                       // pass the byte through the NMEA processor
    if(NMEA.isComplete())                                         // if complete NMEA:
    { ProcessNMEA();                                              // interpret the NMEA
      NMEA.Clear(); }                                             // clear the NMEA processor for the next sentence
  }
  return Count; }

void loop()
{ vTaskDelay(1);
#ifdef WITH_BEEPER
  Play_TimerCheck(1);              // handle playing notes on the buzzer
#endif
#ifdef WITH_BLE_SPP
  BLE_Loop();
#endif
  Button.loop();
#if defined(WITH_WIO_TRACKER) && defined(WITH_BEEPER)
  BuzzerSwitch.loop();
#endif
  while(ProcessInput()>0);         // handle console input
  static GPS_Position *PrevGPS=0;
  GPS_Position *GPS = GPS_getPosition();
  if(GPS==0) { GPS = GPS_Pos+GPS_PosIdx; }
#ifdef WITH_OLED
  if(OLED_PageChange)
  { OLED_PageChange=0;
    if(OLED_DrawPage(GPS)==0) OLED_NextPage(); }
#endif
  if(GPS!=PrevGPS)
  {
#ifdef WITH_OLED
    OLED_PageChange=1;
#ifdef WITH_OLED_DIM
    uint32_t msTime = millis();
    bool USBpowered = (NRF_POWER->USBREGSTATUS & POWER_USBREGSTATUS_VBUSDETECT_Msk)!=0;
    bool GPSlocked = GPS && GPS->isValid();
    if(USBpowered || !GPSlocked) OLED_PageActive = msTime;
    uint32_t Age = msTime-OLED_PageActive;
    OLED_PageOFF = Age>OLED_PageTimeout;
#else
    OLED_PageOFF = 0;
#endif
    if(OLED_PageOFF) OLED.setPowerSave(1);
               else  OLED.setPowerSave(0);
#endif
    PrevGPS=GPS; }

}
